       IDENTIFICATION DIVISION.
       PROGRAM-ID. two-fer.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME PIC X(16) VALUES 'you'.
       01 WS-RESULT PIC X(64).
       PROCEDURE DIVISION.
       TWO-FER.
         STRING 'One for ' DELIMITED BY SIZE
           WS-NAME DELIMITED BY SPACE
           ', one for me.' DELIMITED BY SIZE
           INTO WS-RESULT.
